sdaiLogicalCompare(System.Int32,System.Int32)
\details
The Logical Compare function shall test for the ordering of two values according to the ordering of the
values of the EXPRESS LOGICAL data type.
\param value1 [in] value to compare.
\param value2 [in] value to compare.
\returns In normal condition:
+1 if value1 is greater than value2;
0  if value1 is equal to value2;
-1 if value1 is less than value2.